<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest stable released version of positron IDE.</string>
      <key>Identifier</key>
      <string>com.github.EspenJ.download.Positron</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Positron</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
       <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://github.com/posit-dev/positron/releases</string>
                    <key>re_pattern</key>
                    <string>https://cdn\.posit\.co/positron/releases/mac/arm64/Positron-[0-9.]+-[0-9]+-arm64\.dmg</string>
                    <key>result_output_var_name</key>
                    <string>DOWNLOAD_URL</string>
                    <key>curl_opts</key>
                    <array>
                        <string>--location</string>
                        <string>--compressed</string>
                        <string>--header</string>
                        <string>User-Agent: AutoPkg</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Positron.app</string>
                    <key>requirement</key>
                    <string>identifier "co.posit.positron" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FYF2F5GFX4</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
            <dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/Positron.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleName</key>
					<string>app_name</string>
				</dict>
			</dict>
		</dict>
        </array>
   </dict>
</plist>