<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest stable released version of Copilot for Xcode.</string>
      <key>Identifier</key>
      <string>com.github.EspenJ.download.CopilotChatXcode</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>GitHubCopilotForXcode</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>github_repo</key>
                    <string>github/CopilotForXcode</string>
                </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/GitHub Copilot for Xcode.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.github.CopilotForXcode" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VEKTX9H2N7)</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pathname%/GitHub Copilot for Xcode.app/Contents/Info.plist</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleName</key>
                    <string>app_name</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
        </array>
   </dict>
</plist>