<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of Copilot for Xcode</string>
    <key>Identifier</key>
    <string>com.github.EspenJ.pkg.CopilotChatXcode</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GitHubCopilotForXcode</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.EspenJ.download.CopilotChatXcode</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/GitHub Copilot for Xcode.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>